# Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.
x=2
y=-2
x1=-2
y1=2
len=((x ** 2 + y ** 2) ** 0.5) + ((x1 ** 2 + y1 ** 2) ** 0.5)
print('расстояние между двумя точками = ', len)