# 3. Вывести на экран числа от -N до N.
min = -5
max = 5
for i in range(min, max+1):
    print(i)